src/cf/Catalogs/ВидыНачисленийИУдержаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыНачисленийИУдержаний</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНачисленийИУдержаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоходаНДФЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КодыДоходовНДФЛ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоходаПоСтраховымВзносам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходовПоСтраховымВзносамУНФ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ТипыНачисленийИУдержаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНачисленийИУдержаний</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удержание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налог</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыНачисленийИУдержаний/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

#Область ОбновлениеВерсииИБ

// Определяет настройки начального заполнения элементов.
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов
// 
// Параметры:
//   КодыЯзыков - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.КодыЯзыков
//   Элементы   - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.Элементы
//   ТабличныеЧасти - см. ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлементов.ТабличныеЧасти
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт
	
	// Виды начислений
	ГруппаНачисление = Элементы.Добавить();
	ГруппаНачисление.Наименование = ГруппаНачисленияНаименование();
	ГруппаНачисление.ЭтоГруппа = Истина;
	ГруппаНачисление.Ссылка = Справочники.ВидыНачисленийИУдержаний.ПолучитьСсылку(Новый УникальныйИдентификатор);
	
	ГруппаУдержание = Элементы.Добавить();
	ГруппаУдержание.Наименование = ГруппаУдержанияНаименование();
	ГруппаУдержание.ЭтоГруппа = Истина;
	ГруппаУдержание.Ссылка = Справочники.ВидыНачисленийИУдержаний.ПолучитьСсылку(Новый УникальныйИдентификатор);
	
	РеквизитыОклад = РеквизитыНачисленияОплатаТруда();
	
	// Оклад по дням
	Элемент = Элементы.Добавить();
	ЗаполнитьЗначенияСвойств(Элемент, РеквизитыОклад);
	Элемент.Родитель 			= ГруппаНачисление.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Оклад по дням (производственный календарь)'");
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
	Элемент.Формула				= "[ТарифнаяСтавка] * [ОтработаноДней] / [НормаДней]";
	Элемент.Используется 		= Истина;
	
	// Оклад по часам
	Элемент = Элементы.Добавить();
	ЗаполнитьЗначенияСвойств(Элемент, РеквизитыОклад);
	Элемент.Родитель 			= ГруппаНачисление.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Оклад по часам (производственный календарь)'");
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.КосвенныеЗатраты;
	Элемент.Формула 			= "[ТарифнаяСтавка] * [ОтработаноЧасов] / [НормаЧасов]";
	Элемент.Используется 		= Истина;
	
	// Оклад по дням Графики
	Элемент = Элементы.Добавить();
	ЗаполнитьЗначенияСвойств(Элемент, РеквизитыОклад);
	Элемент.Родитель 			= ГруппаНачисление.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Оклад по дням (график работы сотрудника)'");
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
	Элемент.Формула				= "[ТарифнаяСтавка] * [ОтработаноДней] / [НормаДнейГрафикСотрудника]";
	Элемент.Используется 		= Истина;
	
	// Оклад по часам Графики
	Элемент = Элементы.Добавить();
	ЗаполнитьЗначенияСвойств(Элемент, РеквизитыОклад);
	Элемент.Родитель 			= ГруппаНачисление.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Оклад по часам (график работы сотрудника)'");
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.КосвенныеЗатраты;
	Элемент.Формула 			= "[ТарифнаяСтавка] * [ОтработаноЧасов] / [НормаЧасовГрафикСотрудника]";
	Элемент.Используется 		= Истина;
	
	// Оплата по заданиям
	ОписаниеОплатаЗаданий = ОписаниеОплатаПоЗаданиям();
	Для Каждого ВидОплаты Из ОписаниеОплатаЗаданий Цикл
		Элемент = Элементы.Добавить();
		ЗаполнитьЗначенияСвойств(Элемент, ВидОплаты);
		Элемент.Родитель 			= ГруппаНачисление.Ссылка;
		Элемент.Используется 		= ПолучитьФункциональнуюОпцию("ИспользоватьЗаданияНаРаботу");
	КонецЦикла;
	
	// Процент от продаж по ответственному
	Элемент = Элементы.Добавить();
	ЗаполнитьЗначенияСвойств(Элемент, РеквизитыОклад);
	Элемент.Родитель 			= ГруппаНачисление.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Процент от продаж по ответственному'");
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
	Элемент.Формула 			= "[СуммуПродажПоОтветственному]  / 100 *  [ТарифнаяСтавка]";
	Элемент.Используется 		= Истина;
	
	ОписаниеСдельнаяОплата = ОписаниеНачисленийСдельнаяОплата();
	Для Каждого ВидОплаты Из ОписаниеСдельнаяОплата Цикл
		Элемент = Элементы.Добавить();
		ЗаполнитьЗначенияСвойств(Элемент, ВидОплаты);
		Элемент.Родитель 		= ГруппаНачисление.Ссылка;
		Элемент.Используется 	= ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуРаботы")
									ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьТехоперации");
	КонецЦикла;
	
	ОписанияОплатаРабот = ОписаниеНачисленийОплатаРабот();
	Для Каждого ВидОплаты Из ОписанияОплатаРабот Цикл
		Элемент = Элементы.Добавить();
		ЗаполнитьЗначенияСвойств(Элемент, ВидОплаты);
		Элемент.Родитель 		= ГруппаНачисление.Ссылка;
		Элемент.Используется 	= ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуРаботы");
	КонецЦикла;
	
	// Отпускные
	Элемент = Элементы.Добавить();
	Элемент.Родитель 			= ГруппаНачисление.Ссылка;
	Элемент.Наименование 		= НСтр("ru='Отпускные'");
	Элемент.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
	Элемент.Формула				= "";
	Элемент.КодДоходаНДФЛ 		= Справочники.КодыДоходовНДФЛ.Код2012;
	Элемент.Используется		= Истина;
	Элемент.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ОблагаетсяЦеликом;
	
	// Премия продавцам
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПремияЗаПродажи";
	Элемент.Родитель 			= ГруппаНачисление.Ссылка;
	Элемент.Наименование 		= НСтр("ru = 'Премия продавцам за продажи'");
	Элемент.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
	Элемент.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
	Элемент.Формула 			= "";
	Элемент.КодДоходаНДФЛ 		= Справочники.КодыДоходовНДФЛ.Код2010;
	Элемент.Используется		= Истина;
	Элемент.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ОблагаетсяЦеликом;

	УдержанияЗаймы = ОписаниеУдержанийКредитыЗаймы();
	Для Каждого Удержание Из УдержанияЗаймы Цикл
		Элемент = Элементы.Добавить();
		ЗаполнитьЗначенияСвойств(Элемент, Удержание);
		Элемент.Родитель		= ГруппаУдержание.Ссылка;
		Элемент.Используется 	= ПолучитьФункциональнуюОпцию("КредитыИЗаймы");
	КонецЦикла;
	
	Налоги = ОписаниеНалоги();
	Для Каждого Налог Из Налоги Цикл
		Элемент = Элементы.Добавить();
		ЗаполнитьЗначенияСвойств(Элемент, Налог);
		Элемент.Родитель 		= ГруппаУдержание.Ссылка;
		Элемент.Используется 	= ПолучитьФункциональнуюОпцию("ВестиУчетНалогаНаДоходыИВзносов")
			ИЛИ ПолучитьФункциональнуюОпцию("ИспользоватьРегламентированныйУчетЗарплатыИКадров");
	КонецЦикла;
	
	Взносы = ОписаниеВзносы();
	Для Каждого Взнос Из Взносы Цикл
		Элемент = Элементы.Добавить();
		ЗаполнитьЗначенияСвойств(Элемент, Взнос);
		Элемент.Родитель 		= ГруппаУдержание.Ссылка;
		Элемент.Используется 	= ПолучитьФункциональнуюОпцию("ВестиУчетНалогаНаДоходыИВзносов");
	КонецЦикла;
	
КонецПроцедуры

// Смотри также ОбновлениеИнформационнойБазыПереопределяемый.ПриНачальномЗаполненииЭлемента
//
// Параметры:
//  Объект                  - СправочникОбъект.ВидыКонтактнойИнформации - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения объекта.
//  ДополнительныеПараметры - Структура:
//   * ПредопределенныеДанные - ТаблицаЗначений - данные заполненные в процедуре ПриНачальномЗаполненииЭлементов.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	Объект.УстановитьНовыйКод();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

// Функция возвращает список имен «ключевых» реквизитов.
// 
// Возвращаемое значение:
//   - Массив - имена реквизитов
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ВидНалога");
	Результат.Добавить("Тип");
	
	Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()

// Процедура добавляет начисления - оклад по графику работы сотрудника по дням и часам
//
Процедура ДополнитьВидыНачислений() Экспорт
		
		Группа = Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию(ГруппаНачисленияНаименование());
		
		Если Не ЗначениеЗаполнено(Группа) ИЛИ НЕ Группа.ЭтоГруппа Тогда
			ГруппаНачисление = Справочники.ВидыНачисленийИУдержаний.ПустаяСсылка();
		Иначе
			ГруппаНачисление = Группа;
		КонецЕсли;
		
		ОкладПоДнямНаименование = НСтр("ru='Оклад по дням (график работы сотрудника)'");
		НайденныйЭлементСправочника = Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию(ОкладПоДнямНаименование);
		
		Если Не ЗначениеЗаполнено(НайденныйЭлементСправочника) Тогда
			
			// Оклад по дням Графики
			НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
			НовоеНачисление.Родитель 			= ГруппаНачисление;
			НовоеНачисление.Наименование 		= ОкладПоДнямНаименование;
			НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
			НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
			НовоеНачисление.Формула				= "[ТарифнаяСтавка] * [ОтработаноДней] / [НормаДнейГрафикСотрудника]";
			НовоеНачисление.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
			НовоеНачисление.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ОблагаетсяЦеликом;
			НовоеНачисление.Записать();
			
		КонецЕсли;
		
		ОкладПоЧасамНаименование = НСтр("ru='Оклад по часам (график работы сотрудника)'");
		НайденныйЭлементСправочника = Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию(ОкладПоЧасамНаименование);
		
		Если Не ЗначениеЗаполнено(НайденныйЭлементСправочника) Тогда
			
			// Оклад по часам Графики
			НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
			НовоеНачисление.Родитель 			= ГруппаНачисление;
			НовоеНачисление.Наименование 		= ОкладПоЧасамНаименование;
			НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
			НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.КосвенныеЗатраты;
			НовоеНачисление.Формула 			= "[ТарифнаяСтавка] * [ОтработаноЧасов] / [НормаЧасовГрафикСотрудника]";
			НовоеНачисление.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
			НовоеНачисление.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ОблагаетсяЦеликом;
			НовоеНачисление.Записать();
			
		КонецЕсли
		
КонецПроцедуры

// Устанавливает реквизит Используется для всех видов начислений 
//
Процедура УстановитьПризнакИспользованияПриОбновлении() Экспорт
	
	НачатьТранзакцию();
	
	Попытка
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВидыНачисленийИУдержаний.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыНачисленийИУдержаний КАК ВидыНачисленийИУдержаний
		|ГДЕ
		|	НЕ ВидыНачисленийИУдержаний.ЭтоГруппа";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ОбъектНачисления = Выборка.Ссылка.ПолучитьОбъект();
			ОбъектНачисления.Заблокировать();
			ОбъектНачисления.Используется = Истина;
			ОбъектНачисления.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		СообщениеОбОшибке = НСтр("ru='Установить признак используется для видов начислений'", 
			ОбщегоНазначения.КодОсновногоЯзыка());
			
		ЗаписьЖурналаРегистрации(СообщениеОбОшибке, УровеньЖурналаРегистрации.Ошибка, , , 
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
КонецПроцедуры

// Включение / отключение использования начислений, которые используются для оплаты работ (заказ-наряд):
// СдельнаяОплата, СдельнаяОплатаПроцент, ФиксированнаяСумма
//
// Параметры:
//  Использование	 - Булево	- новое значение реквизита Используется
//
Процедура УстановитьИспользованиеОплатРабот(Использование) Экспорт
	
	// Сдельная оплата также используется в сдельных нарядах
	Если Использование ИЛИ НЕ ПолучитьФункциональнуюОпцию("ИспользоватьТехоперации") Тогда
		ОписаниеНачислений = ОписаниеНачисленийСдельнаяОплата();
		УстановитьИспользованиеПоОписанию(ОписаниеНачислений, ГруппаНачисленияНаименование(), Использование);
	КонецЕсли;
	
	ОписаниеНачислений = ОписаниеНачисленийОплатаРабот();
	УстановитьИспользованиеПоОписанию(ОписаниеНачислений, ГруппаНачисленияНаименование(), Использование);
	
КонецПроцедуры

// Включение / отключение использования начислений, которые используются в сдельных нарядах - СдельнаяОплата
//
// Параметры:
//  Использование	 - Булево	- новое значение реквизита Используется
//
Процедура УстановитьИспользованиеСдельнойОплаты(Использование) Экспорт
	
	// Сдельная оплата также используется в заказ-нарядах
	Если НЕ Использование И ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуРаботы") Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеНачислений = ОписаниеНачисленийСдельнаяОплата();
	УстановитьИспользованиеПоОписанию(ОписаниеНачислений, ГруппаНачисленияНаименование(), Использование);
	
КонецПроцедуры

// Включение / отключение использования начислений, которые используются в заданиях на работу - ОплатаПоЗаданиям
//
// Параметры:
//  Использование	 - Булево	- новое значение реквизита Используется
//
Процедура УстановитьИспользованиеОплатаПоЗаданиям(Использование) Экспорт
	
	ОписаниеНачислений = ОписаниеОплатаПоЗаданиям();
	УстановитьИспользованиеПоОписанию(ОписаниеНачислений, ГруппаНачисленияНаименование(), Использование);
	
КонецПроцедуры

// Включение / отключение использования удержаний для возвращения займов: ПогашениеЗаймаИзЗарплаты, ПроцентыПоЗайму 
//
// Параметры:
//  Использование	 - Булево	- новое значение реквизита Используется
//
Процедура УстановитьИспользованиеУдержанийЗаймы(Использование) Экспорт
	
	ОписаниеУдержаний = ОписаниеУдержанийКредитыЗаймы();
	УстановитьИспользованиеПоОписанию(ОписаниеУдержаний, ГруппаУдержанияНаименование(), Использование);
	
КонецПроцедуры

// Включение / отключение использования налога на доходы
//
// Параметры:
//  Использование	 - Булево	- новое значение реквизита Используется
//
Процедура УстановитьИспользованиеНалоги(Использование) Экспорт
	
	// НДФЛ может быть включен для упр. учета
	Если Использование ИЛИ НЕ ПолучитьФункциональнуюОпцию("ВестиУчетНалогаНаДоходыИВзносов") Тогда
		ОписаниеУдержаний = ОписаниеНалоги();
		УстановитьИспользованиеПоОписанию(ОписаниеУдержаний, ГруппаУдержанияНаименование(), Использование);
	КонецЕсли;

КонецПроцедуры

// Включение / отключение использования налога на доходы и страховых взносов
//
// Параметры:
//  Использование	 - Булево	- новое значение реквизита Используется
//
Процедура УстановитьИспользованиеНалогиВзносы(Использование) Экспорт

	// НДФЛ может быть включен для организаций, использующих регламентированный учет зарплаты
	Если Использование ИЛИ НЕ ПолучитьФункциональнуюОпцию("ИспользоватьРегламентированныйУчетЗарплатыИКадров") Тогда
		ОписаниеУдержаний = ОписаниеНалоги();
		УстановитьИспользованиеПоОписанию(ОписаниеУдержаний, ГруппаУдержанияНаименование(), Использование);
	КонецЕсли;
	
	ОписаниеУдержаний = ОписаниеВзносы();
	УстановитьИспользованиеПоОписанию(ОписаниеУдержаний, ГруппаУдержанияНаименование(), Использование);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("СобственныйВызов") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Параметры.Вставить("СобственныйВызов");
		Отбор = Новый Структура;
		Отбор.Вставить("Используется", Истина);
		Параметры.Вставить("Отбор", Отбор);
		СтандартныйСписок = ПолучитьДанныеВыбора(Параметры);
		ДанныеВыбора = СтандартныйСписок;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ГруппаНачисленияНаименование()
	
	Возврат НСтр("ru='Начисления'");
	
КонецФункции

Функция ГруппаУдержанияНаименование()
	
	Возврат НСтр("ru='Удержания'");
	
КонецФункции

Функция РеквизитыНачисленияОплатаТруда()

	ОписаниеНачисления = Новый Структура;
	ОписаниеНачисления.Вставить("Наименование", "");
	ОписаниеНачисления.Вставить("ИмяПредопределенныхДанных", "");
	ОписаниеНачисления.Вставить("Тип", Перечисления.ТипыНачисленийИУдержаний.Начисление);
	ОписаниеНачисления.Вставить("Формула", "");
	ОписаниеНачисления.Вставить("СчетЗатрат");
	ОписаниеНачисления.Вставить("КодДоходаНДФЛ", Справочники.КодыДоходовНДФЛ.Код2000);
	ОписаниеНачисления.Вставить("ВидДоходаПоСтраховымВзносам", Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ОблагаетсяЦеликом);
	
	Возврат Новый ФиксированнаяСтруктура(ОписаниеНачисления);
	
КонецФункции

Функция РеквизитыНачисленийСдельнаяОплата()

	ОписаниеНачисления = Новый Структура;
	ОписаниеНачисления.Вставить("Наименование", "");
	ОписаниеНачисления.Вставить("ИмяПредопределенныхДанных", "");
	ОписаниеНачисления.Вставить("Тип", Перечисления.ТипыНачисленийИУдержаний.Начисление);
	ОписаниеНачисления.Вставить("Формула", "");
	ОписаниеНачисления.Вставить("СчетЗатрат", ПланыСчетов.Управленческий.НезавершенноеПроизводство);
	ОписаниеНачисления.Вставить("КодДоходаНДФЛ", Справочники.КодыДоходовНДФЛ.Код2010);
	ОписаниеНачисления.Вставить("ВидДоходаПоСтраховымВзносам", Справочники.ВидыДоходовПоСтраховымВзносамУНФ.ДоговорыГПХ);
	
	Возврат Новый ФиксированнаяСтруктура(ОписаниеНачисления);
	
КонецФункции

Функция РеквизитыНалоговВзносов()

	ОписаниеНалога = Новый Структура;
	ОписаниеНалога.Вставить("Наименование", "");
	ОписаниеНалога.Вставить("ИмяПредопределенныхДанных", "");
	ОписаниеНалога.Вставить("Тип", Перечисления.ТипыНачисленийИУдержаний.Налог);
	ОписаниеНалога.Вставить("Формула", "");
	ОписаниеНалога.Вставить("СчетЗатрат", ПланыСчетов.Управленческий.УправленческиеРасходы);
	ОписаниеНалога.Вставить("ВидНалога", Неопределено);
	
	Возврат Новый ФиксированнаяСтруктура(ОписаниеНалога);

КонецФункции

Функция ОписаниеНачисленийСдельнаяОплата()
	
	Результат = Новый Массив;
	
	РеквизитыСдельнаяОплата = Новый Структура(РеквизитыНачисленийСдельнаяОплата());
	РеквизитыСдельнаяОплата.ИмяПредопределенныхДанных = "СдельнаяОплата";
	РеквизитыСдельнаяОплата.Наименование = НСтр("ru='Сдельная оплата (тариф)'");
	
	Результат.Добавить(РеквизитыСдельнаяОплата);
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеНачисленийОплатаРабот()
	
	РеквизитыНачисления = РеквизитыНачисленийСдельнаяОплата();
	
	Результат = Новый Массив;
	
	РеквизитыСдельнаяОплатаПроцент = Новый Структура(РеквизитыНачисления);
	РеквизитыСдельнаяОплатаПроцент.ИмяПредопределенныхДанных = "СдельнаяОплатаПроцент";
	РеквизитыСдельнаяОплатаПроцент.Наименование 		= НСтр("ru='Сдельная оплата (% от суммы)'");
	Результат.Добавить(РеквизитыСдельнаяОплатаПроцент);
	
	РеквизитыФиксированнаяСумма = Новый Структура(РеквизитыНачисления);
	РеквизитыФиксированнаяСумма.ИмяПредопределенныхДанных = "ФиксированнаяСумма";
	РеквизитыФиксированнаяСумма.Наименование 		= НСтр("ru='Сдельная оплата (фиксированная сумма)'");
	РеквизитыФиксированнаяСумма.Формула 			= "[ФиксированнаяСумма]";
	Результат.Добавить(РеквизитыФиксированнаяСумма);
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеУдержанийКредитыЗаймы()
	
	ОписаниеУдержания = Новый Структура;
	ОписаниеУдержания.Вставить("Наименование", "");
	ОписаниеУдержания.Вставить("ИмяПредопределенныхДанных", "");
	ОписаниеУдержания.Вставить("Тип", Перечисления.ТипыНачисленийИУдержаний.Удержание);
	
	РеквизитыУдержания = Новый ФиксированнаяСтруктура(ОписаниеУдержания);
	
	Результат = Новый Массив;
	
	ПогашениеЗайма = Новый Структура(РеквизитыУдержания);
	ПогашениеЗайма.ИмяПредопределенныхДанных = "ПогашениеЗаймаИзЗарплаты";
	ПогашениеЗайма.Наименование = НСтр("ru='Погашение займа из зарплаты'");
	Результат.Добавить(ПогашениеЗайма);
	
	ПогашениеПроцентыПоЗайму = Новый Структура(РеквизитыУдержания);
	ПогашениеПроцентыПоЗайму.ИмяПредопределенныхДанных = "ПроцентыПоЗайму";
	ПогашениеПроцентыПоЗайму.Наименование = НСтр("ru='Проценты по займу'");
	Результат.Добавить(ПогашениеПроцентыПоЗайму);
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеНалоги()

	РеквизитыНалога = РеквизитыНалоговВзносов();
	
	Результат = Новый Массив;
	
	Налог = Новый Структура(РеквизитыНалога);
	Налог.ИмяПредопределенныхДанных = "НалогНаДоходы";
	Налог.Наименование 				= НСтр("ru='Налог на доходы'");
	Налог.ВидНалога 				= Справочники.ВидыНалогов.НДФЛСотрудники;
	Результат.Добавить(Налог);

	Возврат Результат;
	
КонецФункции

Функция ОписаниеВзносы()
	
	РеквизитыВзносов = РеквизитыНалоговВзносов();
	Результат = Новый Массив;
	
	Взнос = Новый Структура(РеквизитыВзносов);
	Взнос.ИмяПредопределенныхДанных = "ПФРПоСуммарномуТарифу";
	Взнос.Наименование 				= НСтр("ru='Взносы в ПФР с 1 января 2014 года'");
	Взнос.ВидНалога 				= Справочники.ВидыНалогов.ПФРСтраховаяСотрудники;
	Результат.Добавить(Взнос);
	
	Взнос = Новый Структура(РеквизитыВзносов);
	Взнос.ИмяПредопределенныхДанных = "ПФРНакопительная";
	Взнос.Наименование 				= НСтр("ru='Взносы в ПФР - накопительная часть(до 2014 года)'");
	Взнос.ВидНалога 				= Справочники.ВидыНалогов.ПФРНакопительнаяСотрудники;
	Результат.Добавить(Взнос);
	
	Взнос = Новый Структура(РеквизитыВзносов);
	Взнос.ИмяПредопределенныхДанных = "ПФРСтраховая";
	Взнос.Наименование 				= НСтр("ru='Взносы в ПФР - страховая часть(до 2014 года)'");
	Взнос.ВидНалога 				= Справочники.ВидыНалогов.ПФРСтраховаяСотрудники;
	Результат.Добавить(Взнос);
	
	Взнос = Новый Структура(РеквизитыВзносов);
	Взнос.ИмяПредопределенныхДанных = "ФСС";
	Взнос.Наименование				= НСтр("ru='Взносы в ФСС (временная нетрудоспособность)'");
	Взнос.ВидНалога 				= Справочники.ВидыНалогов.ФСССотрудники;
	Результат.Добавить(Взнос);
	
	Взнос = Новый Структура(РеквизитыВзносов);
	Взнос.ИмяПредопределенныхДанных = "ФССНесчастныеСлучаи";
	Взнос.Наименование 				= НСтр("ru='Взносы в ФСС (несчастные случаи)'");
	Взнос.ВидНалога 				= Справочники.ВидыНалогов.ФССТравматизмСотрудники;
	Результат.Добавить(Взнос);
	
	Взнос = Новый Структура(РеквизитыВзносов);
	Взнос.ИмяПредопределенныхДанных = "ФФОМС";
	Взнос.Наименование 				= НСтр("ru='Взносы в ФФОМС'");
	Взнос.ВидНалога 				= Справочники.ВидыНалогов.ФОМССотрудники;
	Результат.Добавить(Взнос);
	
	Взнос = Новый Структура(РеквизитыВзносов);
	Взнос.ИмяПредопределенныхДанных = "ВзносыПоЕдиномуТарифу";
	Взнос.Наименование 				= НСтр("ru='Взносы по единому тарифу'");
	Взнос.ВидНалога 				= Справочники.ВидыНалогов.СтраховыеВзносыЕдиныйТариф;
	Результат.Добавить(Взнос);
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеОплатаПоЗаданиям()

	Результат = Новый Массив;
	
	РеквизитыНачисления = Новый Структура(РеквизитыНачисленияОплатаТруда());
	РеквизитыНачисления.Наименование 		= НСтр("ru='Оплата по заданиям'");
	РеквизитыНачисления.СчетЗатрат			= ПланыСчетов.Управленческий.НезавершенноеПроизводство;
	РеквизитыНачисления.Формула 			= "[ТарифнаяСтавка] * [ОтработаноЧасовПоЗаданиям]";
	Результат.Добавить(РеквизитыНачисления);
	
	Возврат Результат;

КонецФункции

Процедура УстановитьИспользованиеПоОписанию(Описания, ИмяРодителя, Использовать)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыНачисленийИУдержаний.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыНачисленийИУдержаний КАК ВидыНачисленийИУдержаний
	|ГДЕ
	|	ВидыНачисленийИУдержаний.ЭтоГруппа
	|	И ВидыНачисленийИУдержаний.Наименование = &Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыНачисленийИУдержаний.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", ИмяРодителя);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Родитель = Выборка.Ссылка;
	Иначе
		Родитель = ПустаяСсылка();
	КонецЕсли;
	
	СписокНачислений = Новый Соответствие;
	КлючиНаименованиеФормула = Новый Массив;
	
	ПутьКСправочнику = Метаданные.Справочники.ВидыНачисленийИУдержаний.ПолноеИмя();
	Для Каждого РеквизитыНачисления Из Описания Цикл
		ДанныеДляОбновления = Новый Структура("Ссылка, Предопределенный, Реквизиты", Неопределено, Ложь, РеквизитыНачисления);
		Если ЗначениеЗаполнено(РеквизитыНачисления.ИмяПредопределенныхДанных) Тогда
			ПутьКЭлементу = СтрШаблон("%1.%2", ПутьКСправочнику, РеквизитыНачисления.ИмяПредопределенныхДанных);
			ДанныеДляОбновления.Ссылка = ОбщегоНазначения.ПредопределенныйЭлемент(ПутьКЭлементу);
			ДанныеДляОбновления.Предопределенный = Истина;
			СписокНачислений.Вставить(РеквизитыНачисления.ИмяПредопределенныхДанных, ДанныеДляОбновления);
		Иначе
			КлючПоиска = СтрШаблон("%1_%2", РеквизитыНачисления.Наименование, Лев(РеквизитыНачисления.Формула, 200));
			СписокНачислений.Вставить(КлючПоиска, ДанныеДляОбновления);
			КлючиНаименованиеФормула.Добавить(КлючПоиска);
		КонецЕсли;
	КонецЦикла;
	
	Если КлючиНаименованиеФормула.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВидыНачисленийИУдержаний.Ссылка КАК Ссылка,
		               |	ВидыНачисленийИУдержаний.Наименование + ""_"" + (ВЫРАЗИТЬ(ВидыНачисленийИУдержаний.Формула КАК СТРОКА(200))) КАК КлючПоиска
		               |ИЗ
		               |	Справочник.ВидыНачисленийИУдержаний КАК ВидыНачисленийИУдержаний
		               |ГДЕ
		               |	ВидыНачисленийИУдержаний.ИмяПредопределенныхДанных = """"
		               |	И ВидыНачисленийИУдержаний.Наименование + ""_"" + (ВЫРАЗИТЬ(ВидыНачисленийИУдержаний.Формула КАК СТРОКА(200))) В (&НаименованиеФормула)";
		Запрос.УстановитьПараметр("НаименованиеФормула", КлючиНаименованиеФормула);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеНачисления = СписокНачислений[Выборка.КлючПоиска];
			Если НЕ ЗначениеЗаполнено(ДанныеНачисления.Ссылка) Тогда
				ДанныеНачисления.Ссылка = Выборка.Ссылка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОбъектыДляИзменения = Новый Массив;
	Для Каждого Элемент Из СписокНачислений Цикл
		
		Данные = Элемент.Значение;
		Если ЗначениеЗаполнено(Данные.Ссылка) Тогда
			ОбъектВид = Данные.Ссылка.ПолучитьОбъект();
		ИначеЕсли Использовать Тогда
			ОбъектВид = СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(ОбъектВид, РеквизитыНачисления);
			ОбъектВид.Родитель = Родитель;
		Иначе
			Продолжить;
		КонецЕсли;
		ОбъектВид.Используется = Использовать;
		
		ОбъектыДляИзменения.Добавить(ОбъектВид);
	КонецЦикла;
	
	Для Каждого ОбъектВид Из ОбъектыДляИзменения Цикл
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектВид);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
